config/doom/config.org
#+title: Emacs Config: Base
#+author: Cash Weaver
#+email: cashweaver@google.com
#+STARTUP: overview
#+filetags: :foo:bar:

This is my Emacs configuration file; written in [[https://orgmode.org][=org-mode=]] in literate programming style and based heavily on the work of others[fn:1].

* Table of Contents :TOC_3:noexport:
- [[#introduction][Introduction]]
  - [[#example-of-literate-programming][Example of Literate Programming]]
  - [[#tangled-files][Tangled Files]]
    - [[#work][Work]]
  - [[#function-and-variable-naming-convention][Function and Variable Naming Convention]]
- [[#doom-emacs][Doom Emacs]]
  - [[#configuration-file-headers][Configuration File headers]]
  - [[#initel][=init.el=]]
- [[#general][General]]
  - [[#user-information][User Information]]
  - [[#home-directory][Home Directory]]
  - [[#cashweaver-is-work-p][=cashweaver-is-work-p=]]
- [[#theme-and-visual][Theme and Visual]]
- [[#dates-and-time][Dates and time]]
  - [[#utility-functions][Utility functions]]
- [[#packages][Packages]]
  - [[#anki-editor][=anki-editor=]]
    - [[#package][Package]]
    - [[#config][Config]]
  - [[#aggressive-indent][=aggressive-indent=]]
    - [[#package-1][Package]]
  - [[#calfw][=calfw=]]
    - [[#package-2][Package]]
    - [[#config-1][Config]]
  - [[#doct-declarative-org-capture-template][=doct= (Declarative Org Capture Template)]]
    - [[#package-3][Package]]
    - [[#config-2][Config]]
  - [[#free-keys][=free-keys=]]
    - [[#package-4][Package]]
    - [[#config-3][Config]]
  - [[#gnus-alias][=gnus-alias=]]
    - [[#package-5][Package]]
    - [[#config-4][Config]]
  - [[#langtool][=langtool=]]
    - [[#package-6][Package]]
    - [[#languagetool][=LanguageTool=]]
    - [[#config-5][Config]]
  - [[#writegood-mode][=writegood-mode=]]
    - [[#package-7][Package]]
  - [[#notmuch][=notmuch=]]
    - [[#package-8][Package]]
    - [[#config-6][Config]]
  - [[#operate-on-number][=operate-on-number=]]
    - [[#package-9][Package]]
    - [[#config-7][Config]]
  - [[#org-ql][=org-ql=]]
    - [[#package-10][Package]]
  - [[#org-gcal][=org-gcal=]]
    - [[#package-11][Package]]
  - [[#org-mime][=org-mime=]]
    - [[#package-12][Package]]
    - [[#config-8][Config]]
  - [[#org-mode][=org-mode=]]
    - [[#general-1][General]]
    - [[#agenda][Agenda]]
    - [[#publish][Publish]]
    - [[#helper-methods][Helper Methods]]
    - [[#capture-templates][Capture Templates]]
  - [[#org-noter][=org-noter=]]
    - [[#package-13][Package]]
    - [[#config-9][Config]]
  - [[#org-notmuch][=org-notmuch=]]
    - [[#package-14][Package]]
    - [[#config-10][Config]]
  - [[#org-roam][=org-roam=]]
    - [[#package-15][Package]]
    - [[#config-11][Config]]
  - [[#org-super-agenda][=org-super-agenda=]]
    - [[#package-16][Package]]
  - [[#ox-pandoc][=ox-pandoc=]]
    - [[#package-17][Package]]
    - [[#config-12][Config]]
  - [[#pdf-tools][=pdf-tools=]]
    - [[#package-18][Package]]
    - [[#config-13][Config]]
  - [[#alert][=alert=]]
    - [[#package-19][Package]]
    - [[#config-14][Config]]
  - [[#ox-hugo][=ox-hugo=]]
    - [[#package-20][Package]]
    - [[#config-15][Config]]
  - [[#org-wild-notifier][=org-wild-notifier=]]
    - [[#package-21][Package]]
    - [[#config-16][Config]]
- [[#mail][Mail]]
- [[#key-bindings][Key bindings]]
  - [[#general-2][General]]
  - [[#org-mode-1][=org-mode=]]
  - [[#notmuch-1][=notmuch=]]
  - [[#pdf-fiew-mode-map][=pdf-fiew-mode-map=]]
- [[#load-additional-config-files][Load Additional Config Files]]
  - [[#config-workel][=config-work.el=]]
  - [[#packages-workel][=packages-work.el=]]
- [[#footnotes][Footnotes]]

* Introduction
** Example of Literate Programming

As an example of literate programming with =org-mode=, let's generate a throw-away file, =foo.md=. First, we'll add the title:

#+begin_src md :tangle foo.md
# Foo
#+end_src

Notice that I specified the syntax (=md=) and the file to output the content to (=foo.md=). Next, let's add a list of my favorite colors.

#+begin_src md :tangle foo.md
1. Orange
1. Blue
1. Red
#+end_src

Now we can run =org-babel-tangle= to extract the content of these two blocks and create =foo.md=. The newly generated =foo.md= will contain:

#+begin_src md
# Foo

1. Orange
1. Blue
1. Red
#+end_src
** Tangled Files

This single file tangles the following files:

- =init.el= defines which of the existing Doom [[https://github.com/hlissner/doom-emacs/blob/develop/docs/getting_started.org#modules][modules]] are loaded. A Doom module is a bundle of packages, configuration, and commands which are organized into a unit that can be toggled easily from this file.
- =packages.el= defines which [[https://github.com/hlissner/doom-emacs/blob/develop/docs/getting_started.org#package-management][packages]] should be installed, beyond those that are installed and loaded as part of the enabled modules.
- =config.el= contains all [[https://github.com/hlissner/doom-emacs/blob/develop/docs/getting_started.org#configuring-doom][custom configuration]] and code.

*** Work :work:

- =packages-work.el=: A version of =packages.el= which contains packages for my work environment.
- =config-work.el=: A version of =config.el= which contains configuration for my work environment.

** Function and Variable Naming Convention

I prefix all of my own functions and variables with =cashweaver-= to prevent any unintentional overlaps.

#+begin_src emacs-lisp
(setq
 cashweaver-favorite-color "orange")
#+end_src

"Private" functions and variables -- those I wouldn't indend to be accessed directly -- are prefixed with =cashweaver--= (note the two =-='s).

#+begin_src emacs-lisp
(setq
 cashweaver--secret-color "blue")
#+end_src

Additionally, variables and functions which are in a "library"/group are prefixed with either =cashweaver-<library name>-= or =cashweaver-<library name>--=, depending on their intended visibility.

#+begin_src emacs-lisp
(setq
 cashweaver-colors-favorite "orange"
 cashweaver-colors--secret "blue")
#+end_src

* Doom Emacs

I use [[https://github.com/hlissner/doom-emacs][Doom Emacs]] as the base for my configuration to save time and get to coding faster than I would if I had to roll my entire config from scratch.

