config/doom/config.txt
                          ____________________

                           EMACS CONFIG: BASE

                              Cash Weaver
                          ____________________


Table of Contents
_________________

1. Introduction
.. 1. Example of Literate Programming
.. 2. Tangled Files
..... 1. Work                                                     :work:
.. 3. Function and Variable Naming Convention
2. Doom Emacs
.. 1. Configuration File headers
.. 2. `init.el'
3. General
.. 1. User Information
.. 2. Home Directory
.. 3. `cashweaver-is-work-p'
4. Theme and Visual
5. Dates and time
.. 1. Utility functions
6. Packages
.. 1. `aggressive-indent'
..... 1. Package
.. 2. `calfw'
..... 1. Package
..... 2. Config
.. 3. `doct' ([Declarative Org Capture Template])
..... 1. Package
..... 2. Config
.. 4. `free-keys'
..... 1. Package
..... 2. Config
.. 5. `gnus-alias'
..... 1. Package
..... 2. Config
.. 6. `langtool'
..... 1. Package
..... 2. `LanguageTool'
..... 3. Config
.. 7. `writegood-mode'
..... 1. Package
.. 8. `notmuch'
..... 1. Package
..... 2. Config
.. 9. `operate-on-number'
..... 1. Package
..... 2. Config
.. 10. `org-gcal'
..... 1. Package
.. 11. `org-mime'
..... 1. Package
..... 2. Config
.. 12. `org-mode'
..... 1. General
..... 2. Agenda
..... 3. Publish
..... 4. Helper Methods
.. 13. `org-noter'
..... 1. Package
..... 2. Config
.. 14. `org-notmuch'
..... 1. Package
..... 2. Config
.. 15. `org-roam'
..... 1. Package
..... 2. Config
.. 16. `org-super-agenda'
..... 1. Package
.. 17. `ox-pandoc'
..... 1. Package
.. 18. `pdf-tools'
..... 1. Package
..... 2. Config
.. 19. `alert'
..... 1. Package
..... 2. Config
.. 20. `ox-hugo'
..... 1. Package
..... 2. Config
.. 21. `org-wild-notifier'
..... 1. Package
..... 2. Config
7. Mail
8. Key bindings
.. 1. General
.. 2. `org-mode'
.. 3. `notmuch'
9. Load Additional Config Files
.. 1. `config-work.el'
.. 2. `packages-work.el'


This is my Emacs configuration file; written in [`org-mode'] in literate
programming style and based heavily on the work of others[1].


[`org-mode'] <https://orgmode.org>


1 Introduction
==============

1.1 Example of Literate Programming
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

  As an example of literate programming with `org-mode', let's generate
  a throw-away file, `foo.md'. First, we'll add the title:

  ,----
  | # Foo
  `----

  Notice that I specified the syntax (`md') and the file to output the
  content to (`foo.md'). Next, let's add a list of my favorite colors.

  ,----
  | 1. Orange
  | 1. Blue
  | 1. Red
  `----

  Now we can run `org-babel-tangle' to extract the content of these two
  blocks and create `foo.md'. The newly generated `foo.md' will contain:

  ,----
  | # Foo
  | 
  | 1. Orange
  | 1. Blue
  | 1. Red
  `----


1.2 Tangled Files
~~~~~~~~~~~~~~~~~

  This single file tangles the following files:

  - `init.el' defines which of the existing Doom [modules] are loaded. A
    Doom module is a bundle of packages, configuration, and commands
    which are organized into a unit that can be toggled easily from this
    file.
  - `packages.el' defines which [packages] should be installed, beyond
    those that are installed and loaded as part of the enabled modules.
  - `config.el' contains all [custom configuration] and code.


[modules]
<https://github.com/hlissner/doom-emacs/blob/develop/docs/getting_started.org#modules>

[packages]
<https://github.com/hlissner/doom-emacs/blob/develop/docs/getting_started.org#package-management>

[custom configuration]
<https://github.com/hlissner/doom-emacs/blob/develop/docs/getting_started.org#configuring-doom>

1.2.1 Work                                                        :work:
----------

  - `packages-work.el': A version of `packages.el' which contains
    packages for my work environment.
  - `config-work.el': A version of `config.el' which contains
    configuration for my work environment.


1.3 Function and Variable Naming Convention
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

  I prefix all of my own functions and variables with `cashweaver-' to
  prevent any unintentional overlaps.

  ,----
  | (setq
  |  cashweaver-favorite-color "orange")
  `----

  "Private" functions and variables -- those I wouldn't indend to be
  accessed directly -- are prefixed with `cashweaver--' (note the two
  `-''s).

  ,----
  | (setq
  |  cashweaver--secret-color "blue")
  `----

  Additionally, variables and functions which are in a "library"/group
  are prefixed with either `cashweaver-<library name>-' or
  `cashweaver-<library name>--', depending on their intended visibility.

  ,----
  | (setq
  |  cashweaver-colors-favorite "orange"
  |  cashweaver-colors--secret "blue")
  `----


2 Doom Emacs
============

  I use [Doom Emacs] as the base for my configuration to save time and
  get to coding faster than I would if I had to roll my entire config
  from scratch.


[Doom Emacs] <https://github.com/hlissner/doom-emacs>

2.1 Configuration File headers
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
