config/doom/config.org
** =init.el=

#+HTMl: <details><summary>init.el</summary>
#+attr_html: :collapsed t
#+begin_src emacs-lisp :tangle init.el :noweb no-export
(doom!
 :input
 <<doom-input>>

 :completion
 <<doom-completion>>

 :ui
 <<doom-ui>>

 :editor
 <<doom-editor>>

 :emacs
 <<doom-emacs>>

 :term
 <<doom-term>>

 :checkers
 <<doom-checkers>>

 :tools
 <<doom-tools>>

 :os
 <<doom-os>>

 :lang
 <<doom-lang>>

 :email
 <<doom-email>>

 :app
 <<doom-app>>

 :config
 <<doom-config>>
 )
#+end_src
#+HTMl: </details>

#+HTMl: <details><summary>doom-input</summary>
#+name: doom-input
#+begin_src emacs-lisp
 ;;chinese
 ;;japanese
 ;;layout            ; auie,ctsrnm is the superior home row
#+end_src
#+HTMl: </details>

#+HTMl: <details><summary>doom-completion</summary>
#+name: doom-completion
#+begin_src emacs-lisp
 company             ; the ultimate code completion backend
 ;;helm              ; the *other* search engine for love and life
 ;;ido               ; the other *other* search engine...
 ivy                 ; a search engine for love and life
#+end_src
#+HTMl: </details>

#+HTMl: <details><summary>doom-ui</summary>
#+name: doom-ui
#+begin_src emacs-lisp
 ;;deft              ; notational velocity for Emacs
 doom                ; what makes DOOM look the way it does
 doom-dashboard      ; a nifty splash screen for Emacs
 doom-quit           ; DOOM quit-message prompts when you quit Emacs
 (emoji              ; 🙂
  +ascii
  +github
  +unicode)
 ;;fill-column       ; a `fill-column' indicator
 hl-todo             ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW
 ;;hydra
 ;;indent-guides     ; highlighted indent columns
 ;;ligatures         ; ligatures and symbols to make your code pretty again
 ;;minimap           ; show a map of the code on the side
 modeline            ; snazzy, Atom-inspired modeline, plus API
 ;;nav-flash         ; blink cursor line after big motions
 ;;neotree           ; a project drawer, like NERDTree for vim
 ophints             ; highlight the region an operation acts on
 (popup +defaults)   ; tame sudden yet inevitable temporary windows
 ;;tabs              ; a tab bar for Emacs
 ;;treemacs          ; a project drawer, like neotree but cooler
 unicode             ; extended unicode support for various languages
 vc-gutter          ; vcs diff in the fringe
 vi-tilde-fringe     ; fringe tildes to mark beyond EOB
 ;;window-select     ; visually switch windows
 workspaces          ; tab emulation, persistence & separate workspaces
 ;;zen               ; distraction-free coding or writing
#+end_src
#+HTMl: </details>

#+HTMl: <details><summary>doom-editor</summary>
#+name: doom-editor
#+begin_src emacs-lisp
 (evil +everywhere)  ; come to the dark side, we have cookies
 file-templates      ; auto-snippets for empty files
 fold                ; (nigh) universal code folding
 ;;(format +onsave)  ; automated prettiness
 ;;god               ; run Emacs commands without modifier keys
 lispy             ; vim for lisp, for people who don't like vim
 ;;multiple-cursors  ; editing in many places at once
 ;;objed             ; text object editing for the innocent
 ;;parinfer          ; turn lisp into python, sort of
 ;;rotate-text       ; cycle region at point between text candidates
 snippets            ; my elves. They type so I don't have to
 word-wrap           ; soft wrapping with language-aware indent
#+end_src
#+HTMl: </details>

#+HTMl: <details><summary>doom-emacs</summary>
#+name: doom-emacs
#+begin_src emacs-lisp
 dired               ; making dired pretty [functional]
 electric            ; smarter, keyword-based electric-indent
 ;;ibuffer           ; interactive buffer management
 undo                ; persistent, smarter undo for your inevitable mistakes
 vc                  ; version-control and Emacs, sitting in a tree
#+end_src
#+HTMl: </details>

#+HTMl: <details><summary>doom-term</summary>
#+name: doom-term
#+begin_src emacs-lisp
 ;;eshell            ; the elisp shell that works everywhere
 ;;shell             ; simple shell REPL for Emacs
 ;;term              ; basic terminal emulator for Emacs
 vterm               ; the best terminal emulation in Emacs
#+end_src
#+HTMl: </details>

#+HTMl: <details><summary>doom-checkers</summary>
#+name: doom-checkers
#+begin_src emacs-lisp
;; tasing you for every semicolon you forget
syntax
;; tasing you for misspelling mispelling
(spell
 +flyspell
 +everywhere)
;; tasing grammar mistake every you make
grammar
#+end_src
#+HTMl: </details>

#+HTMl: <details><summary>doom-tools</summary>
#+name: doom-tools
#+begin_src emacs-lisp
 ;;ansible
 ;;debugger          ; FIXME stepping through code, to help you add bugs
 ;;direnv
 ;;docker
 ;;editorconfig      ; let someone else argue about tabs vs spaces
 ;;ein               ; tame Jupyter notebooks with emacs
 (eval +overlay)     ; run code, run (also, repls)
 ;;gist              ; interacting with github gists
 lookup              ; navigate your code and its documentation
 ;;lsp
 magit               ; a git porcelain for Emacs
 ;;make              ; run make tasks from Emacs
 ;;pass              ; password manager for nerds
 pdf               ; pdf enhancements
 ;;prodigy           ; FIXME managing external services & code builders
 ;;rgb               ; creating color strings
 ;;taskrunner        ; taskrunner for all your projects
 ;;terraform         ; infrastructure as code
 ;;tmux              ; an API for interacting with tmux
 ;;upload            ; map local to remote projects via ssh/ftp
#+end_src
#+HTMl: </details>

#+HTMl: <details><summary>doom-os</summary>
#+name: doom-os
#+begin_src emacs-lisp
 (:if IS-MAC macos)  ; improve compatibility with macOS
 ;;tty               ; improve the terminal Emacs experience
#+end_src
#+HTMl: </details>

#+HTMl: <details><summary>doom-lang</summary>
#+name: doom-lang
#+begin_src emacs-lisp
 ;;agda              ; types of types of types of types...
 ;;cc                ; C/C++/Obj-C madness
 ;;clojure           ; java with a lisp
 ;;common-lisp       ; if you've seen one lisp, you've seen them all
 ;;coq               ; proofs-as-programs
 ;;crystal           ; ruby at the speed of c
 ;;csharp            ; unity, .NET, and mono shenanigans
 ;;data              ; config/data formats
 ;;(dart +flutter)   ; paint ui and not much else
 ;;elixir            ; erlang done right
 ;;elm               ; care for a cup of TEA?
 emacs-lisp          ; drown in parentheses
 ;;erlang            ; an elegant language for a more civilized age
 ;;ess               ; emacs speaks statistics
 ;;faust             ; dsp, but you get to keep your soul
 ;;fsharp            ; ML stands for Microsoft's Language
 ;;fstar             ; (dependent) types and (monadic) effects and Z3
 ;;gdscript          ; the language you waited for
 ;;(go +lsp)         ; the hipster dialect
 ;;(haskell +dante)  ; a language that's lazier than I am
 ;;hy                ; readability of scheme w/ speed of python
 ;;idris             ; a language you can depend on
 ;;json              ; At least it ain't XML
 java                ; the poster child for carpal tunnel syndrome
 javascript          ; all(hope(abandon(ye(who(enter(here))))))
 ;;julia             ; a better, faster MATLAB
 ;;kotlin            ; a better, slicker Java(Script)
 ;;latex             ; writing papers in Emacs has never been so fun
 ;;lean
 ;;factor
 ;;ledger            ; an accounting system in Emacs
 ;;lua               ; one-based indices? one-based indices
 markdown            ; writing docs for people to ignore
 ;;nim               ; python + lisp at the speed of c
 ;;nix               ; I hereby declare "nix geht mehr!"
 ;;ocaml             ; an objective camel
 (org                ; organize your plain life in plain text
  +noter
  +pretty
  +roam2
  +pandoc
  +pomodoro)
 ;;php               ; perl's insecure younger brother
 ;;plantuml          ; diagrams for confusing people more
 ;;purescript        ; javascript, but functional
 python              ; beautiful is better than ugly
 ;;qt                ; the 'cutest' gui framework ever
 ;;racket            ; a DSL for DSLs
 ;;raku              ; the artist formerly known as perl6
 ;;rest              ; Emacs as a REST client
 ;;rst               ; ReST in peace
 ;;(ruby +rails)     ; 1.step {|i| p "Ruby is #{i.even? ? 'love' : 'life'}"}
 ;;rust              ; Fe2O3.unwrap().unwrap().unwrap().unwrap()
 ;;scala             ; java, but good
 ;;scheme            ; a fully conniving family of lisps
 sh                  ; she sells {ba,z,fi}sh shells on the C xor
 ;;sml
 ;;solidity          ; do you need a blockchain? No.
 ;;swift             ; who asked for emoji variables?
 ;;terra             ; Earth and Moon in alignment for performance.
 ;;web               ; the tubes
 yaml                ; JSON, but readable
#+end_src
#+HTMl: </details>

#+HTMl: <details><summary>doom-email</summary>
#+name: doom-email
#+begin_src emacs-lisp
 ;;(mu4e +gmail)
 notmuch
 ;;(wanderlust +gmail)
#+end_src
#+HTMl: </details>

#+HTMl: <details><summary>doom-app</summary>
#+name: doom-app
#+begin_src emacs-lisp
 ;;calendar
 ;;emms
 everywhere
 ;;irc               ; how neckbeards socialize
 ;;(rss +org)        ; emacs as an RSS reader
 ;;twitter           ; twitter client https://twitter.com/vnought
#+end_src
#+HTMl: </details>

#+HTMl: <details><summary>doom-config</summary>
#+name: doom-config
#+begin_src emacs-lisp
 ;;literate
 (default +bindings +smartparens)
#+end_src
#+HTMl: </details>

