config/doom/config.org
* General
** User Information

#+begin_src emacs-lisp :tangle config.el
(setq
 user-full-name "Cash Weaver"
 user-mail-address "cashweaver@google.com")
#+end_src
** Home Directory

#+name: cashweaver-home-dir
#+begin_src emacs-lisp
(setq
 cashweaver-home-dir-home
 "/home/cashweaver"
 cashweaver-home-dir-work
 "/usr/local/google/home/cashweaver")
#+end_src

#+begin_src emacs-lisp :tangle config.el :noweb no-export
<<cashweaver-home-dir>>
#+end_src

#+begin_src emacs-lisp :tangle packages.el :noweb no-export
<<cashweaver-home-dir>>
#+end_src


#+RESULTS:
: /usr/local/google/home/cashweaver

** =cashweaver-is-work-p=

This file contains the my base configuration for emacs. I have other config files, nameely =config-work.org=, which extend this file for specific environments.

#+name: cashweaver-work-config-dir
#+begin_src emacs-lisp
(defvar
 cashweaver-work-config-dir
 (format
  "%s/%s"
  cashweaver-home-dir-work
  ".config/doom")
 "Full path to work Emacs cofiguration files.")
#+end_src

#+RESULTS: cashweaver-work-config-dir
: /usr/local/google/home/cashweaver/.config/doom

#+name: cashweaver-is-work-p
#+begin_src emacs-lisp
(defun cashweaver-is-work-p ()
  "Return true if executed on my work machine."
  (file-directory-p cashweaver-work-config-dir))
#+end_src

#+begin_src emacs-lisp :tangle config.el :noweb no-export
<<cashweaver-work-config-dir>>
<<cashweaver-is-work-p>>
#+end_src

#+begin_src emacs-lisp :tangle packages.el :noweb no-export
<<cashweaver-work-config-dir>>
<<cashweaver-is-work-p>>
#+end_src

* Theme and Visual

#+begin_src emacs-lisp :tangle config.el
(setq
 doom-theme 'doom-tomorrow-night
 show-trailing-whitespace t)
#+end_src

* Dates and time

#+begin_src emacs-lisp :tangle config.el
(setq
 ;; Use YYYY-MM-DD date format.
 calendar-date-style 'iso)
#+end_src

** Utility functions

#+begin_src emacs-lisp :tangle config.el
(defun cashweaver-get-date (&optional date-format offset-days)
  "Return the (offset) date in format."
  (interactive)
  (let ((date-format (or date-format "%Y-%m-%d"))
        (offset-days (or offset-days 0)))
    (shell-command-to-string
     (format "echo -n $(date \"+%s\" --date=\"%d days\")" date-format offset-days))))

(defun cashweaver-todays-date ()
  "Return todays date as YYYY-MM-DD."
  (cashweaver-get-date
   ; date-format
   "%Y-%m-%d"
   ; offset-days
   0))

(defun cashweaver-yesterdays-date ()
  "Return yesterday's date as YYYY-MM-DD."
  (cashweaver-get-date
   ; date-format
   "%Y-%m-%d"
   ; offset-days
   -1))
#+end_src

* Packages

#+begin_src emacs-lisp :tangle packages.el
(defvar
  cashweaver--local-package-path
  (if (cashweaver-is-work-p)
      "/usr/local/google/home/cashweaver/third_party"
    "/home/cashweaver/third_party")
  "Path to local emacs package files.")
#+end_src

** =anki-editor=
*** Package

#+begin_src emacs-lisp :tangle packages.el
(package! anki-editor
  :recipe (:host github
           :repo "cashweaver/anki-editor"))
#+end_src

*** Config

#+begin_src emacs-lisp :tangle config.el
(use-package! anki-editor
  :config
  (setq
   anki-editor-remove-single-paragraph-tags t
   anki-editor-use-math-jax t))

(defun cashweaver-anki-editor-insert-note ()
  (interactive)
  (with-current-buffer
      (find-file-noselect
       "~/proj/anki-cards/anki.org")
    (point-min)
    (anki-editor-insert-note)))
#+end_src

#+RESULTS:
: cashweaver-anki-editor-insert-note

** =aggressive-indent=
*** Package

#+begin_src emacs-lisp :tangle packages.el
(package! aggressive-indent)
#+end_src


#+begin_src emacs-lisp :tangle config.el
(use-package! aggressive-indent
  :config
  (add-hook 'emacs-lisp-mode-hook #'aggressive-indent-mode))
#+end_src
**** Work :work:

#+begin_src emacs-lisp :tangle config.el
(after! gnus-alias
  (setq
   gnus-alias-identity-alist '(("work"
                                ;; Refers to
                                nil
                                "Cash Weaver <cashweaver@google.com>"
                                ;; Organization
                                nil
                                ;; Extra headers
                                nil
                                ;; Body
                                nil "~/.email_signature"))
   gnus-alias-default-identity "work"))
#+end_src

** =calfw=
*** Package
Provided through =app/calendar= in =init.el=.

*** Config
#+begin_src emacs-lisp :tangle config.el
;(use-package! calfw-cal
;  :config
;  (setq
;   ; Start the week on Monday
;   calendar-week-start-day 1))
;
;(use-package! calfw-ical)
;(use-package! calfw-org)
;
;(defun cashweaver-calfw-open ()
;  "Open my calendar"
;  (interactive)
;  (cfw:open-calendar-buffer
;   :contents-sources
;   (list
;    (cfw:org-create-source "Green"))))
#+end_src

** =doct= ([[https://github.com/progfolio/doct][Declarative Org Capture Template]])
*** Package
#+begin_src emacs-lisp :tangle packages.el
(package! doct)
#+end_src
*** Config

#+begin_src emacs-lisp :tangle config.el
(use-package! doct
  :commands (doct))
#+end_src
** =free-keys=
*** Package
#+begin_src emacs-lisp :tangle packages.el
(package! free-keys
  :recipe (:host github
           :repo "Fuco1/free-keys"))
#+end_src

*** Config

#+begin_src emacs-lisp :tangle config.el
(use-package! free-keys)
#+end_src

** =gnus-alias=
*** Package

#+begin_src emacs-lisp :tangle packages.el
(package! gnus-alias)
#+end_src

*** Config

#+begin_src emacs-lisp :tangle config.el
(use-package! gnus-alias
  :config
  (autoload 'gnus-alias-determine-identity "gnus-alias" "" t)
  (gnus-alias-init))
#+end_src
**** Work :work:

#+begin_src emacs-lisp :tangle config.el
(after! gnus-alias
  (setq
   gnus-alias-identity-alist '(("work"
                                ;; Refers to
                                nil
                                "Cash Weaver <cashweaver@google.com>"
                                ;; Organization
                                nil
                                ;; Extra headers
                                nil
                                ;; Body
                                nil "~/.email_signature"))
   gnus-alias-default-identity "work"))
#+end_src

** =langtool=

*** Package

=langtool= is provided by =init.el=.

*** =LanguageTool=

Install =LanguageTool=:

A large number of angry people.

1. Download the [[https://languagetool.org/download/LanguageTool-stable.zip][latest stable build]].
2. Store it somewhere on your system.
3. Configure =langtool-language-tool-server-jar=.

*** Config

#+begin_src emacs-lisp :tangle config.el
(use-package! langtool
  :init
  (setq
   langtool-language-tool-server-jar
   "~/third_party/LanguageTool-5.5/languagetool-server.jar"
   ;;langtool-language-tool-jar
   ;;"~/third_party/LanguageTool-5.5/languagetool-commandline.jar"
   )
  :config
  (setq
   langtool-default-language
   "en-US"
   langtool-mother-tongue
   "en"))
#+end_src

** =writegood-mode=

*** Package

=writegood-mode= is provided by =init.el=.

** =notmuch=
*** Package

=notmuch= is provided by =init.el=.

