config/doom/config.txt
  |  user-full-name "Cash Weaver"
  |  user-mail-address "cashweaver@google.com")
  `----


3.2 Home Directory
~~~~~~~~~~~~~~~~~~

  ,----
  | (setq
  |  cashweaver-home-dir-home
  |  "/home/cashweaver"
  |  cashweaver-home-dir-work
  |  "/usr/local/google/home/cashweaver")
  `----

  ,----
  | <<cashweaver-home-dir>>
  `----

  ,----
  | <<cashweaver-home-dir>>
  `----


3.3 `cashweaver-is-work-p'
~~~~~~~~~~~~~~~~~~~~~~~~~~

  This file contains the my base configuration for emacs. I have other
  config files, nameely `config-work.org', which extend this file for
  specific environments.

  ,----
  | (defvar
  |  cashweaver-work-config-dir
  |  (format
  |   "%s/%s"
  |   cashweaver-home-dir-work
  |   ".config/doom")
  |  "Full path to work Emacs cofiguration files.")
  `----

  ,----
  | (defun cashweaver-is-work-p ()
  |   "Return true if executed on my work machine."
  |   (file-directory-p cashweaver-work-config-dir))
  `----

  ,----
  | <<cashweaver-work-config-dir>>
  | <<cashweaver-is-work-p>>
  `----

  ,----
  | <<cashweaver-work-config-dir>>
  | <<cashweaver-is-work-p>>
  `----


4 Theme and Visual
==================

  ,----
  | (setq
  |  doom-theme 'doom-tomorrow-night
  |  show-trailing-whitespace t)
  `----


5 Dates and time
================

  ,----
  | (setq
  |  ;; Use YYYY-MM-DD date format.
  |  calendar-date-style 'iso)
  `----


5.1 Utility functions
~~~~~~~~~~~~~~~~~~~~~

  ,----
  | (defun cashweaver-get-date (&optional date-format offset-days)
  |   "Return the (offset) date in format."
  |   (interactive)
  |   (let ((date-format (or date-format "%Y-%m-%d"))
  |         (offset-days (or offset-days 0)))
  |     (shell-command-to-string
  |      (format "echo -n $(date \"+%s\" --date=\"%d days\")" date-format offset-days))))
  | 
  | (defun cashweaver-todays-date ()
  |   "Return todays date as YYYY-MM-DD."
  |   (cashweaver-get-date
  |    ; date-format
  |    "%Y-%m-%d"
  |    ; offset-days
  |    0))
  | 
  | (defun cashweaver-yesterdays-date ()
  |   "Return yesterday's date as YYYY-MM-DD."
  |   (cashweaver-get-date
  |    ; date-format
  |    "%Y-%m-%d"
  |    ; offset-days
  |    -1))
  `----


6 Packages
==========

  ,----
  | (defvar
  |   cashweaver--local-package-path
  |   (if (cashweaver-is-work-p)
  |       "/usr/local/google/home/cashweaver/third_party"
  |     "/home/cashweaver/third_party")
  |   "Path to local emacs package files.")
  `----


6.1 `aggressive-indent'
~~~~~~~~~~~~~~~~~~~~~~~

6.1.1 Package
-------------

  ,----
  | (package! aggressive-indent)
  `----


  ,----
  | (use-package! aggressive-indent
  |   :config
  |   (add-hook 'emacs-lisp-mode-hook #'aggressive-indent-mode))
  `----


* 6.1.1.1 Work                                                    :work:

  ,----
  | (after! gnus-alias
  |   (setq
  |    gnus-alias-identity-alist '(("work"
  |                                 ;; Refers to
  |                                 nil
  |                                 "Cash Weaver <cashweaver@google.com>"
  |                                 ;; Organization
  |                                 nil
  |                                 ;; Extra headers
  |                                 nil
  |                                 ;; Body
  |                                 nil "~/.email_signature"))
  |    gnus-alias-default-identity "work"))
  `----


6.2 `calfw'
~~~~~~~~~~~

6.2.1 Package
-------------

  Provided through `app/calendar' in `init.el'.


6.2.2 Config
------------

  ,----
  | ;(use-package! calfw-cal
  | ;  :config
  | ;  (setq
  | ;   ; Start the week on Monday
  | ;   calendar-week-start-day 1))
  | ;
  | ;(use-package! calfw-ical)
  | ;(use-package! calfw-org)
  | ;
  | ;(defun cashweaver-calfw-open ()
  | ;  "Open my calendar"
  | ;  (interactive)
  | ;  (cfw:open-calendar-buffer
  | ;   :contents-sources
  | ;   (list
  | ;    (cfw:org-create-source "Green"))))
  `----


6.3 `doct' ([Declarative Org Capture Template])
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

[Declarative Org Capture Template] <https://github.com/progfolio/doct>

6.3.1 Package
-------------

  ,----
  | (package! doct)
  `----


6.3.2 Config
------------

  ,----
  | (use-package! doct
  |   :commands (doct))
  `----


6.4 `free-keys'
~~~~~~~~~~~~~~~

6.4.1 Package
-------------

  ,----
  | (package! free-keys
  |   :recipe (:host github
  |            :repo "Fuco1/free-keys"))
  `----


6.4.2 Config
------------

  ,----
  | (use-package! free-keys)
  `----


6.5 `gnus-alias'
~~~~~~~~~~~~~~~~

6.5.1 Package
-------------

  ,----
  | (package! gnus-alias)
  `----


6.5.2 Config
------------

  ,----
  | (use-package! gnus-alias
  |   :config
  |   (autoload 'gnus-alias-determine-identity "gnus-alias" "" t)
  |   (gnus-alias-init))
  `----


* 6.5.2.1 Work                                                    :work:

  ,----
  | (after! gnus-alias
  |   (setq
  |    gnus-alias-identity-alist '(("work"
  |                                 ;; Refers to
  |                                 nil
  |                                 "Cash Weaver <cashweaver@google.com>"
  |                                 ;; Organization
  |                                 nil
  |                                 ;; Extra headers
  |                                 nil
  |                                 ;; Body
  |                                 nil "~/.email_signature"))
  |    gnus-alias-default-identity "work"))
  `----


6.6 `langtool'
~~~~~~~~~~~~~~

6.6.1 Package
-------------

  `langtool' is provided by `init.el'.


6.6.2 `LanguageTool'
--------------------

  Install `LanguageTool':

  A large number of angry people.

  1. Download the [latest stable build].
  2. Store it somewhere on your system.
  3. Configure `langtool-language-tool-server-jar'.


[latest stable build]
<https://languagetool.org/download/LanguageTool-stable.zip>


6.6.3 Config
------------

  ,----
  | (use-package! langtool
  |   :init
  |   (setq
  |    langtool-language-tool-server-jar
  |    "~/third_party/LanguageTool-5.5/languagetool-server.jar"
  |    ;;langtool-language-tool-jar
  |    ;;"~/third_party/LanguageTool-5.5/languagetool-commandline.jar"
  |    )
  |   :config
  |   (setq
  |    langtool-default-language
  |    "en-US"
  |    langtool-mother-tongue
  |    "en"))
  `----


6.7 `writegood-mode'
~~~~~~~~~~~~~~~~~~~~

6.7.1 Package
-------------

  `writegood-mode' is provided by `init.el'.


6.8 `notmuch'
~~~~~~~~~~~~~

6.8.1 Package
-------------

  `notmuch' is provided by `init.el'.


6.8.2 Config
------------

  ,----
  | (defun cashweaver-notmuch-show-open-or-close-all ()
