config/doom/config.org
*** Config

#+begin_src emacs-lisp :tangle config.el
(defun cashweaver-notmuch-show-open-or-close-all ()
  "Toggle between showing and hiding all messages in the thread."
  (interactive))

(defun cashweaver-notmuch--search-thread-has-tag-p (match-tag)
  "Whether or not the thread has a tag."
  (interactive)
  (let ((thread-tags (notmuch-search-get-tags)))
    (member match-tag thread-tags)))

(defun cashweaver-notmuch-search-toggle-tag (tag)
  "Toggle the provided tag."
  (interactive)
  (if (member tag (notmuch-search-get-tags))
      (notmuch-search-tag (list (concat "-" tag)))
    (notmuch-search-tag (list (concat "+" tag)))))

(defun cashweaver-notmuch--search-thread-toggle-tag (key)
  "Toggle the specified tag(s)."
  (interactive "k")
  (let ((tags (assoc key cashweaver-notmuch-tag-alist)))
    (apply 'notmuch-search-tag (cdr tags))))

(defun cashweaver-notmuch-search-super-archive (&optional beg end)
  "Super archive the selected thread; based on `notmuch-search-archive-thread'."
  (interactive (notmuch-interactive-region))
  (notmuch-search-tag cashweaver-notmuch-super-archive-tags beg end)
  (when (eq beg end)
    (notmuch-search-next-thread)))

(defun cashweaver-org-notmuch-capture-follow-up-mail()
  "Capture mail to org mode."
  (interactive)
  (org-store-link nil)
  (org-capture nil "ef"))

(after! notmuch
  (setq
   notmuch-wash-wrap-lines-length 100
   notmuch-saved-searches '((:name "inbox"
                             :key "i"
                             :query "tag:inbox")
                            (:name "p0"
                             :key "0"
                             :query "tag:p0")
                            (:name "bugs"
                             :key "b"
                             :query "tag:Bug AND tag:inbox")
                            (:name "bugs (all)"
                             :key "B"
                             :query "tag:Bug")
                            (:name "waiting"
                             :key "w"
                             :query "tag:waiting")
                            (:name "automated"
                             :key "a"
                             :query "tag:Automated AND tag:inbox")
                            (:name "to-read"
                             :key "r"
                             :query "tag:Read!")
                            (:name "sent"
                             :key "s"
                             :query "tag:sent")
                            (:name "drafts"
                             :key "d"
                             :query "tag:draft")
                            (:name "calendar-events"
                             :key "c"
                             :query "tag:Calendar-Events AND tag:inbox")
                            (:name "calendar-events (all)"
                             :key "C"
                             :query "tag:Calendar-Events"))
   +notmuch-home-function (lambda ()
                            (notmuch-search "tag:inbox"))
   notmuch-archive-tags '("-inbox"
                          "-unread")
   notmuch-search-line-faces '(("p0" . '(:foreground "red3"))
                               ("Bug" . '(:foreground "ivory4"))
                               ("waiting" . '(:foreground "orange3"))
                               ("Calendar-Events" . '(:foreground "DeepSkyBlue3"))
                               ("Read!" . '(:foreground "magenta3")))
   ;; Superset of `notmuch-archive-tags' for super archiving.
   cashweaver-notmuch-super-archive-tags (append
                                          notmuch-archive-tags
                                          '("-p0"
                                            "-waiting"
                                            "-Read!")))

  ;; Prevent wrapping at 70 characters in email composition.
  (add-hook! 'message-mode-hook 'turn-off-auto-fill)
  (add-hook! 'message-mode-hook 'visual-line-mode))
#+end_src

#+RESULTS:

** =operate-on-number=
*** Package
#+begin_src emacs-lisp :tangle packages.el
(package! operate-on-number
  :recipe (:host github
           :repo "knu/operate-on-number.el"))
#+end_src

*** Config

#+begin_src emacs-lisp :tangle config.el
(use-package! operate-on-number)
#+end_src

** =org-ql=
*** Package
#+begin_src emacs-lisp :tangle packages.el
(package! org-ql)
#+end_src
** =org-gcal=
*** Package
#+begin_src emacs-lisp :tangle packages.el
(package! org-gcal)
#+end_src
** =org-mime=
*** Package
#+begin_src emacs-lisp :tangle packages.el
(package! org-mime)
#+end_src
*** Config
#+begin_src emacs-lisp :tangle config.el
(use-package! org-mime)
#+end_src

** =org-mode=

*** General

#+begin_src emacs-lisp :tangle config.el
(setq
 cashweaver-org-non-archival-filepaths
 '())

(defun cashweaver-org-mode-when-done ()
  "Archive entry when it is marked as done (as defined by `org-done-keywords')."
  (when (org-entry-is-done-p)
    (org-clock-out-if-current)
    (unless (org-get-repeat)
      (unless
          (seq-contains-p
           cashweaver-org-non-archival-filepaths
           buffer-file-name)
        (org-archive-subtree-default)))))

(defun cashweaver-org-mode-when-inprogress ()
  "Handle inprogress ehavior"
  (when (string-equal (org-get-todo-state) "INPROGRESS")
    (org-clock-in)))

(after! org
  :config
  (setq
   org-ellipsis " ▾ "
   org-log-done 'time
   ;; Start the org agenda mini-calendar on Monday.
   calendar-week-start-day 1
   org-priority-highest 0
   org-priority-default 2
   org-priority-lowest 4
   org-hide-leading-stars t
   org-todo-keywords
   '((sequence
      ;; A task that needs doing & is ready to do
      "TODO(t)"
      ;; A project, which usually contains other tasks
      "PROJ(p)"
      ;; A task that is in progress
      "INPROGRESS(i)"
      ;; Something external is holding up this task
      "BLOCKED(b)"
      ;; This task is paused/on hold because of me
      "HOLD(h)"
      "|"
      ;; Task successfully completed
      "DONE(d)"
      ;; Task was moved
      "MOVE(m)"
      ;; Task was cancelled, aborted or is no longer applicable
      "KILL(k)")
     (sequence
      ;; A task that needs doing
      "[ ](T)"
      ;; Task is in progress
      "[-](S)"
      ;; Task is being held up or paused
      "[?](W)"
      "|"
      ;; Task was completed
      "[X](D)"))
   org-todo-keyword-faces
   '(("[-]"  . +org-todo-active)
     ("INPROGRESS" . +org-todo-active)
     ("[?]"  . +org-todo-onhold)
     ("BLKD" . +org-todo-onhold)
     ("HOLD" . +org-todo-onhold)
     ("PROJ" . +org-todo-project))
   org-structure-template-alist
   '(("a" . "export ascii")
     ("c" . "center")
     ("C" . "comment")
     ("e" . "example")
     ("E" . "export")
     ("Eh" . "export html")
     ("El" . "export latex")
     ("q" . "quote")
     ("s" . "src")
     ("se" . "src emacs-lisp")
     ("v" . "verse")))
  (add-hook!
   'org-after-todo-state-change-hook
   'cashweaver-org-mode-when-inprogress)
  (add-hook!
   'org-after-todo-state-change-hook
   'cashweaver-org-mode-when-done))
#+end_src

*** Agenda

#+begin_src emacs-lisp :tangle config.el
(after! org-agenda
  (setq
   org-agenda-skip-scheduled-if-deadline-is-shown t
   org-agenda-skip-scheduled-if-done t
   org-agenda-skip-scheduled-if-done t
   org-agenda-skip-deadline-if-done t
   org-agenda-include-deadlines t
   org-agenda-block-separator nil
   org-agenda-compact-blocks t
   org-agenda-start-day nil ;; i.e. today
   org-agenda-span 1
   org-agenda-start-on-weekday nil))
#+end_src

