config/doom/config.txt
  |    org-publish-project-alist
  |    '(("cashweaver.com"
  |       :base-directory "~/proj/blog-posts/posts/"
  |       :base-extension "org"
  |       :publishing-directory "~/proj/cashweaver.com/content/posts/"
  |       :publishing-function org-pandoc-publish-to-md
  |       :section-numbers t
  |       :with-toc nil))))
  | 
  `----


6.12.4 Helper Methods
---------------------

* 6.12.4.1 Create a heading for today

  ,----
  | (defun cashweaver-org-mode-insert-heading-for-today ()
  |   "Insert a heading for today's date, with relevant tags."
  |   (interactive)
  |   (let* ((today-week-number (cashweaver-get-date "%W"))
  |          (today-quarter-number (cashweaver-get-date "%q"))
  |          (today-year (cashweaver-get-date "%Y"))
  |          (today-month (cashweaver-get-date "%m"))
  |          (today-day (cashweaver-get-date "%d"))
  |          (today-weekday-name (cashweaver-get-date "%A")))
  |     (org-insert-heading-respect-content)
  |     (insert
  |      (format "%s-%s-%s %s :week%s:quarter%s:"
  |              today-year
  |              today-month
  |              today-day
  |              today-weekday-name
  |              today-week-number
  |              today-quarter-number))))
  | 
  | (defun cashweaver-org-mode-insert-heading-for-this-week ()
  |   "Insert a heading for this week, with relevant tags."
  |   (interactive)
  |   (let* ((today-week-number (cashweaver-get-date "%W"))
  |          (today-quarter-number (cashweaver-get-date "%q"))
  |          (today-year (cashweaver-get-date "%Y")))
  |     (org-insert-heading-respect-content)
  |     (insert
  |      (format "%s Week %s :week%s:quarter%s:"
  |              today-year
  |              today-week-number
  |              today-week-number
  |              today-quarter-number))))
  `----


* 6.12.4.2 Scheduling task for my calendar blocks

  ,----
  | (setq
  |  cashweaver--schedule-block-day '(:start "07:00" :end "19:00")
  |  cashweaver--schedule-block-one '(:start "07:00" :end "09:00")
  |  cashweaver--schedule-block-two '(:start "09:00" :end "11:00")
  |  cashweaver--schedule-block-three '(:start "14:00" :end "16:00")
  |  cashweaver--schedule-block-four '(:start "16:00" :end "18:00"))
  | 
  | (defun cashweaver-org-schedule-for-block (block-time &optional date)
  |   (interactive)
  |   (let ((start-time (plist-get block-time :start))
  |         (end-time (plist-get block-time :end))
  |         (date (or date "today")))
  |     (org-schedule nil (format "%s %s-%s"
  |                               date
  |                               start-time
  |                               end-time))))
  | 
  | (defun cashweaver-org-schedule-today-from-to (start-time end-time &optional date)
  |   (interactive)
  |   (let ((date (or date "today")))
  |     (org-schedule nil (format "%s %s-%s"
  |                               date
  |                               start-time
  |                               end-time))))
  `----


* 6.12.4.3 Schedule task

  ,----
  | (defun cashweaver-org--schedule-today-at (start-time-as-string)
  |   "Schedule a task today at the specified time."
  |   (interactive "sWhen?: ")
  |   (message start-time-as-string)
  |   (string-match
  |    "^\\([1-9]\\|[01][0-9]\\|2[0-3]\\):?\\([0-5][0-9]\\)?$"
  |    start-time-as-string)
  |   (let
  |       ((hour
  |         (string-to-number
  |          (or
  |           (match-string 1 start-time-as-string)
  |           "0")))
  |        (minute
  |         (string-to-number
  |          (or
  |           (match-string 2 start-time-as-string)
  |           "0"))))
  |     (org-schedule nil (format "today %02d:%02d"
  |                               hour
  |                               minute))
  |     (message (number-to-string hour))
  |     ))
  `----


* 6.12.4.4 Schedule task for duration

  ,----
  | (defun cashweaver-org--schedule-for (start-time end-time &optional date)
  |   (let ((date (or date "today")))
  |     (org-schedule nil (format "%s %s-%s"
  |                               date
  |                               start-time
  |                               end-time))))
  |     ;(org-schedule nil (format "%s %s-%s"
  |                               ;date
  |                               ;start-time
  |                               ;end-time))))
  `----

  ,----
  | (defun cashweaver-org--schedule-at-for-minutes (start-minute start-hour duration-in-minutes &optional date)
  |   (let* ((start-time-in-minutes-since-midnight
  |          (+ start-minute (* start-hour 60)))
  |         (end-time-in-minutes-since-midnight
  |          (+ start-time-in-minutes-since-midnight duration-in-minutes))
  |         (end-minute (mod end-time-in-minutes-since-midnight 60))
  |         (end-hour (/ end-time-in-minutes-since-midnight 60))
  |         (date (or date "today")))
  |     (org-schedule nil (format "%s %02d:%02d-%02d:%02d"
  |                               date
  |                               start-hour
  |                               start-minute
  |                               end-hour
  |                               end-minute))))
  `----


* 6.12.4.5 Scheduling task at start of pomodoro

  ,----
  | (setq
  |  cashweaver--schedule-pomodoro-one '(:start "09:00" :end "09:50")
  |  cashweaver--schedule-pomodoro-two '(:start "10:00" :end "10:50")
  |  cashweaver--schedule-pomodoro-three '(:start "11:00" :end "11:50")
  |  cashweaver--schedule-pomodoro-four '(:start "12:00" :end "12:50")
  |  cashweaver--schedule-pomodoro-five '(:start "13:00" :end "13:50")
  |  cashweaver--schedule-pomodoro-six '(:start "14:00" :end "14:50")
  |  cashweaver--schedule-pomodoro-seven '(:start "15:00" :end "15:50")
  |  cashweaver--schedule-pomodoro-eight '(:start "16:00" :end "16:50")
  |  cashweaver--schedule-pomodoro-nine '(:start "17:00" :end "17:50")
  |  cashweaver--schedule-pomodoro-ten '(:start "18:00" :end "18:50"))
  `----

  ,----
  | (defun cashweaver-org-schedule-at-pomodoro (pomodoro-time &optional date)
  |   (interactive)
  |   (let ((start-time (plist-get pomodoro-time :start)))
  |         (date (or date "today")))
  |     (org-schedule nil (format "%s %s"
  |                               date
  |                               start-time)))
  `----


* 6.12.4.6 Scheduling task in N hours

  ,----
  | (defun cashweaver-org-schedule-in-n-hours (offset-hours &optional date)
  |   (interactive)
  |   (let* ((time-list (parse-time-string (current-time-string)))
  |          (current-hour (nth 2 time-list))
  |          (current-minute (nth 1 time-list))
  |          (hour (mod (+ current-hour offset-hours) 24))
  |          (date (or date "today")))
  |     (org-schedule nil (format "%s %s:%s"
  |                               date
  |                               hour
  |                               current-minute))))
  `----


* 6.12.4.7 Scheduling task in N days

  ,----
  | (defun cashweaver-org-schedule-in-n-workdays (num-days &optional time)
  |   (interactive)
  |   (let*
  |       ((time (or time "09:00"))
  |        (offset-days))
  |     (org-schedule
  |      nil
  |      (format "%s %s"
  |              offset-days
  |              time))))
  `----


6.13 `org-noter'
~~~~~~~~~~~~~~~~

6.13.1 Package
--------------
