config/doom/config.org
*** Capture Templates

#+begin_src emacs-lisp :tangle config.el
(after! org
  (setq
   org-capture-templates
   (doct '(("Anki"
            :keys "a"
            :file "~/proj/anki-cards/anki.org"
            :olp ("Default")
            :note-type (lambda ()
                         (completing-read
                          "Note type: "
                          (sort
                           (anki-editor-note-types)
                           #'string-lessp)))
            :note-type-prop anki-editor-prop-note-type
            :template ("* %?"
                       ":PROPERTIES:"
                       ":ANKI_NOTE_TYPE: %{note-type}"
                       ":END:")
            :hook (lambda ()
                    (let* ((note-type
                            (org-entry-get
                             (point)
                             anki-editor-prop-note-type))
                           (fields
                            (anki-editor-api-call-result
                             'modelFieldNames
                             :modelName note-type))
                           ;; Ignore the first field.
                           ;; We'll set it as the title for the subtree.
                           (first-field
                            (pop fields))
                           (second-field
                            (pop fields)))
                      (org-insert-subheading nil)
                      (insert second-field)
                      (dolist (field fields)
                        (org-insert-heading nil)
                        (insert field))
                      (outline-up-heading 1)
                      (evil-org-append-line 1))))))))
#+end_src

#+RESULTS:
| a | Anki | entry | (file+olp ~/proj/anki-cards/anki.org Default) | #'doct--fill-template | :doct | (:doct-name Anki :keys a :file ~/proj/anki-cards/anki.org :olp (Default) :note-type (lambda nil (completing-read Note type:  (sort (anki-editor-note-types) #'string-lessp))) :note-type-prop anki-editor-prop-note-type :template (* %? :PROPERTIES: :ANKI_NOTE_TYPE: %{note-type} :END:) :hook (lambda nil (let* ((note-type (org-entry-get (point) anki-editor-prop-note-type)) (fields (anki-editor-api-call-result 'modelFieldNames :modelName note-type)) (first-field (pop fields)) (second-field (pop fields))) (org-insert-subheading nil) (insert second-field) (dolist (field fields) (org-insert-heading nil) (insert field)) (outline-up-heading 1) (evil-org-append-line 1))) :doct-custom (:note-type (lambda nil (completing-read Note type:  (sort (anki-editor-note-types) #'string-lessp))) :note-type-prop anki-editor-prop-note-type)) |

** =org-noter=
*** Package

I've customized org-noter to [[https://github.com/cashweaver/org-noter/commit/e18a4314308d5dd211759682b1aeb083a822673d][wrap quoted text with =begin_quote=/=end_quote=]]

#+begin_src emacs-lisp :tangle packages.el
(package! org-noter
  :recipe (:host github
           :repo "cashweaver/org-noter"))
#+end_src

*** Config

#+begin_src emacs-lisp :tangle config.el
(defun cashweaver-org-noter-insert-selected-text-inside-note-content ()
  "Insert selected text in org-noter note.

Reference: https://github.com/weirdNox/org-noter/issues/88#issuecomment-700346146"
  (interactive)
  (progn
    (setq currenb (buffer-name))
    (org-noter-insert-precise-note)
    (set-buffer currenb)
    (org-noter-insert-note)))
#+end_src

#+RESULTS:
: cashweaver-org-noter-insert-selected-text-inside-note-content

** =org-notmuch=
*** Package

#+begin_src emacs-lisp :tangle packages.el
(package! ol-notmuch
  :recipe `(:local-repo
            ,(format
              "%s/%s"
              cashweaver--local-package-path
              "org-mode/contrib/lisp")
            :files
            ("ol-notmuch.el")))
#+end_src

*** Config

#+begin_src emacs-lisp :tangle config.el
(use-package! ol-notmuch
  :after org)
#+end_src

** =org-roam=
*** Package

=org-roam= is provided by =init.el=.

