config/doom/config.org
*** Config

#+begin_src emacs-lisp :tangle config.el
(defun cashweaver-org-roam--add-title-headline-when-exporting (backend)
  "TODO"
  (when (and (equal backend 'hugo)
             (org-roam-file-p))
    (insert "foocashweaverfoo")))

;;(remove-hook!
 ;;'org-export-before-processing-hook
 ;;#'cashweaver-org-roam--add-title-headline-when-exporting)

(defun cashweaver-org-roam-make-filepath (title &optional time time-zone)
  "Return a filenaem for an org-roam node.

Reference: https://ag91.github.io/blog/2020/11/12/write-org-roam-notes-via-elisp"
  (let ((timestamp
         (format-time-string
          "%Y%m%d%H%M%S"
          (or time
              (current-time))
          (or time-zone
              (current-time-zone))))
        (slug
         (org-roam-node-slug
          (org-roam-node-create
           :title title))))
    (format
     "%s/%s-%s.org"
     org-roam-directory
     timestamp
     slug)))
;;(cashweaver-org-roam-make-filepath "This is the foo")

(defun cashweaver-org-mode-insert-option (option value)
  "Insert an org-mode option (#+OPTION: VALUE)."
  (interactive)
  (insert
   (format
    "#+%s: %s\n"
    option
    value)))

(defun cashweaver-org-mode-insert-options (options)
  "Insert an alist of org-mode options (#+OPTION: VALUE)."
  (interactive)
  (cl-loop for (option . value) in options
           do (cashweaver-org-mode-insert-option
               option
               value)))

(defun cashweaver-org-mode-insert-property (property value)
  "Insert an org-mode property (:PROPERTY: VALUE)."
  (interactive)
  (insert
   (format
    ":%s: %s\n"
    property
    value)))

(defun cashweaver-org-mode-insert-properties (properties)
  "Insert an alist of org-mode properties (:PROPERTY: VALUE).

When WRAP is non-nil: Wrap the properties with :PROPERTIES:/:END:."
  (interactive)
  (cl-loop for (property . value) in properties
           do (org-set-property
               property
               value)))

(defun cashweaver-org-roam-new-node (file-path title &optional properties)
  "Build a new org-roam node in a temp file.

PROPERTIES is expected to be an alist of additional properties to include.

Reference: https://ag91.github.io/blog/2020/11/12/write-org-roam-notes-via-elisp"
  (let* ((id
          (org-id-new))
         (dir
          (format
           "%s/%s"
           cashweaver-org-roam-attachment-base-path
           id))
         (created
          (format ))
         (all-properties
          (append
           `(("ID" . ,id)
             ("DIR" . ,dir))
           properties)))
    (with-temp-file
        file-path
      (cashweaver-org-mode-insert-properties
       all-properties)
      (goto-char
       (point-max))
      (cashweaver-org-mode-insert-options
       `(("TITLE" . ,title)
         ("STARTUP" . "overview")))
      (org-insert-heading)
      (insert
       "Summary")
      (org-insert-heading)
      (insert
       "Notes")
      (org-insert-heading)
      (insert
       "Thoughts"))))

(defun cashweaver-org-roam-new-node-from-link-heading-at-point (&optional mark-as-done)
  "Build a new org-roam node from the link heading at point."
  (interactive)
  (let* ((link
          (org-element-context))
         (type
          (org-element-property
           :type
           link))
         (url
          (org-element-property
           :raw-link
           link))
         (description
          (cashweaver-org-mode-get-description-from-link-at-point))
         (org-roam-node-file-path
          (cashweaver-org-roam-make-filepath description)))
    ;; TODO Replace with regexp?
    (unless (or (string= type "http")
                (string= type "https")))
    (cashweaver-org-roam-new-node
     org-roam-node-file-path
     description
     `(("ROAM_REFS" . ,url)))
    (if mark-as-done
        (org-todo "DONE"))
    (find-file
     org-roam-node-file-path)))

(defun cashweaver-org-mode-get-description-from-link-at-point ()
  "Reference: https://emacs.stackexchange.com/a/38297"
  (interactive)
  (let ((link
         (org-element-context)))
    (message
     "%s"
     (buffer-substring-no-properties
      (org-element-property
       :contents-begin
       link)
      (org-element-property
       :contents-end
       link)))))

(defun cashweaver-org-roam-open-ref ()
  "Open the ROAM_REF."
  (interactive)
  (let ((roam-refs
         (org-entry-get
          (point)
          "ROAM_REFS")))
    (if (s-starts-with-p
         "http"
         roam-refs)
        (browse-url roam-refs)
      (message
       "Not an http(s) ref (%s)"
       roam-refs))))

;; TODO Consolidate this and the bit in `cashweaver-org-roam-new-node'
(defun cashweaver-org-roam-insert-attachment-path ()
  (let ((dir
         (format
          "%s/%s"
          cashweaver-org-roam-attachment-base-path
          (org-id-get))))
    (save-excursion
      (org-set-property
       "DIR"
       dir))))


(defun cashweaver-org-roam--mirror-roam-refs-to-front-matter ()
  "Copy the list of ROAM_REFS into hugo_custom_front_matter."
  (when (org-roam-file-p)
    (when-let*
        ((keyword
          "HUGO_CUSTOM_FRONT_MATTER")
         (raw-roam-refs
          (org-export-get-node-property
           :ROAM_REFS
           (org-element-parse-buffer)))
         (refs
          (split-string
           raw-roam-refs
           " +"))
         (roam-refs
          (format
           "roam_refs '(%s)"
           (string-join
            (mapcar
             (lambda (ref)
               (format "\"%s\"" ref))
             refs)
            " ")))
         (current-roam-refs
          (or 
           (org-roam-get-keyword
            keyword)
           "")))
      (if (not (string=
                roam-refs
                current-roam-refs))
          (org-roam-set-keyword
           (downcase keyword)
           roam-refs)))))

;; Override
;;
;; 1. Export even on first save from org-capture.
;; 2. Make roam files known to org exporter.
;; 3. Mirror ROAM_REFS to hugo_custom_front_matter
(defun org-hugo-export-wim-to-md-after-save ()
  "See `org-hugo-export-wim-to-md-after-save'."
  (let ((org-id-extra-files
         (org-roam-list-files)))
    (org-hugo-export-wim-to-md)))


(add-hook!
 'before-save-hook
 #'cashweaver-org-roam--mirror-roam-refs-to-front-matter)

(use-package! org-roam
  :after org
  :config
  (setq
   org-roam-directory
   (file-truename
    "~/proj/roam")
   cashweaver-org-roam-attachment-base-path
   (file-truename
    (format
     "%s/attachments"
     org-roam-directory))
   org-roam-capture-templates
   `(("d" "default" plain "%?" :target
      (file+head
       "${slug}.org"
       ,(concat
         "#+title: ${title}\n"
         "#+author: Cash Weaver\n"
         "#+date: [%<%Y-%m-%d %a %H:%M>]\n"
         "#+startup: overview\n"
         "#+hugo_auto_set_lastmod: t\n"
         "\n\n"))
      :unnarrowed t)))
  (add-hook!
   'org-roam-capture-new-node-hook
   'cashweaver-org-roam-insert-attachment-path)
  (org-roam-db-autosync-mode))

(org-roam-list-files)
#+end_src

#+RESULTS:
| /home/cashweaver/proj/roam/unread.org | /home/cashweaver/proj/roam/deregulating_distraction_moving_towards_the_goal_and_level_hopping.org | /home/cashweaver/proj/roam/career_moat.org | /home/cashweaver/proj/roam/mindfulness_based_stress_reduction.org | /home/cashweaver/proj/roam/idea_queue.org | /home/cashweaver/proj/roam/polyphasic_sleep_40_day_trial_results.org | /home/cashweaver/proj/roam/deep_work_hypothesis.org | /home/cashweaver/proj/roam/humans_are_not_automatically_strategic.org | /home/cashweaver/proj/roam/deep_work.org | /home/cashweaver/proj/roam/be_impatient.org | /home/cashweaver/proj/roam/ask_hn_what_was_the_best_decision_you_made_in_your_career.org | /home/cashweaver/proj/roam/tsuyoku_naritai_i_want_to_become_stronger.org | /home/cashweaver/proj/roam/there_s_no_speed_limit.org | /home/cashweaver/proj/roam/a.org | /home/cashweaver/proj/roam/monthly_newsletter_as_a_thinking_tool.org | /home/cashweaver/proj/roam/attention_is_your_scarcest_resource.org | /home/cashweaver/proj/roam/three_paths_in_the_tech_industry_founder_executive_or_employee.org | /home/cashweaver/proj/roam/productivity_notes_from_sam_altman.org | /home/cashweaver/proj/roam/psychophysiologic_symptom_relief_therapy.org | /home/cashweaver/proj/roam/the_first_lesson.org | /home/cashweaver/proj/roam/attention_capital_theory.org | /home/cashweaver/proj/roam/three_kinds_of_non_fiction_books.org | /home/cashweaver/proj/roam/theory_of_change.org | /home/cashweaver/proj/roam/exceed_your_level.org | /home/cashweaver/proj/roam/noticing_the_taste_of_lotus.org | /home/cashweaver/proj/roam/learned_blankness.org | /home/cashweaver/proj/roam/meaningful_rest.org | /home/cashweaver/proj/roam/at_least_two_of_the_same.org |

** =org-super-agenda=
*** Package

#+begin_src emacs-lisp :tangle packages.el
(package! org-super-agenda)
#+end_src

** =ox-pandoc=
*** Package

#+begin_src emacs-lisp :tangle packages.el
(package! ox-pandoc)
#+end_src

