config/doom/config.txt
  |     :n "RET" #'org-table-copy-down)
  | 
  |    (:prefix ("d")
  |     (:prefix ("h" . "insert heading")
  |      :n "d" #'cashweaver-org-mode-insert-heading-for-today
  |      :n "w" #'cashweaver-org-mode-insert-heading-for-this-week)
  |     (:prefix ("S")
  |      (:prefix ("." . "today")
  |       :desc "at" :n "a" #'cashweaver-org--schedule-today-at)
  |      (:prefix ("h" . "hour")
  |       (:prefix ("1" . "1?:??")
  |        :desc "10:00" :n "0" (cmd! (cashweaver-org-schedule-today-from-to
  |                                    "10:00"
  |                                    "10:50"))
  |        :desc "11:00" :n "3" (cmd! (cashweaver-org-schedule-today-from-to
  |                                    "11:00"
  |                                    "11:50"))
  |        :desc "12:00" :n "2" (cmd! (cashweaver-org-schedule-today-from-to
  |                                    "12:00"
  |                                    "12:50"))
  |        :desc "13:00" :n "3" (cmd! (cashweaver-org-schedule-today-from-to
  |                                    "13:00"
  |                                    "13:50"))
  |        :desc "14:00" :n "4" (cmd! (cashweaver-org-schedule-today-from-to
  |                                    "14:00"
  |                                    "14:50"))
  |        :desc "15:00" :n "5" (cmd! (cashweaver-org-schedule-today-from-to
  |                                    "15:00"
  |                                    "15:50"))
  |        :desc "16:00" :n "6" (cmd! (cashweaver-org-schedule-today-from-to
  |                                    "16:00"
  |                                    "16:50"))
  |        :desc "17:00" :n "7" (cmd! (cashweaver-org-schedule-today-from-to
  |                                    "17:00"
  |                                    "17:50"))
  |        :desc "18:00" :n "8" (cmd! (cashweaver-org-schedule-today-from-to
  |                                    "18:00"
  |                                    "18:50"))
  |        :desc "19:00" :n "9" (cmd! (cashweaver-org-schedule-today-from-to
  |                                    "19:00"
  |                                    "19:50")))
  |       (:prefix ("2" . "2?:??")
  |        :desc "20:00" :n "0" (cmd! (cashweaver-org-schedule-today-from-to
  |                                    "20:00"
  |                                    "20:50"))
  |        :desc "21:00" :n "3" (cmd! (cashweaver-org-schedule-today-from-to
  |                                    "21:00"
  |                                    "21:50"))
  |        :desc "22:00" :n "2" (cmd! (cashweaver-org-schedule-today-from-to
  |                                    "22:00"
  |                                    "22:50"))
  |        :desc "23:00" :n "3" (cmd! (cashweaver-org-schedule-today-from-to
  |                                    "23:00"
  |                                    "23:50")))
  |       :desc "03:00" :n "3" (cmd! (cashweaver-org-schedule-today-from-to
  |                                   "03:00"
  |                                   "03:50"))
  |       :desc "04:00" :n "4" (cmd! (cashweaver-org-schedule-today-from-to
  |                                   "04:00"
  |                                   "04:50"))
  |       :desc "05:00" :n "5" (cmd! (cashweaver-org-schedule-today-from-to
  |                                   "05:00"
  |                                   "05:50"))
  |       :desc "06:00" :n "6" (cmd! (cashweaver-org-schedule-today-from-to
  |                                   "06:00"
  |                                   "06:50"))
  |       :desc "07:00" :n "7" (cmd! (cashweaver-org-schedule-today-from-to
  |                                   "07:00"
  |                                   "07:50"))
  |       :desc "08:00" :n "8" (cmd! (cashweaver-org-schedule-today-from-to
  |                                   "08:00"
  |                                   "08:50"))
  |       :desc "09:00" :n "9" (cmd! (cashweaver-org-schedule-today-from-to
  |                                   "09:00"
  |                                   "09:50")))))
  |    (:prefix ("M" . "Mail")
  |     :desc "switch to message-mode" :n "t" #'cashweaver-mail-toggle-org-message-mode)
  |    (:prefix ("m")
  |     :desc "Open ref" :n "O" #'cashweaver-org-roam-open-ref
  |     :desc "Create node from headline link" :n "N" (cmd! ()
  |                                                         (cashweaver-org-roam-new-node-from-link-heading-at-point
  |                                                          ;; mark-as-done
  |                                                          t)))
  |    (:prefix ("S" . "Structure")
  |     :n "i" #'org-insert-structure-template)))
  `----


8.3 `notmuch'
~~~~~~~~~~~~~

  ,----
  | (after! notmuch
  |   ;; Keep in alphabetical order.
  |   (map!
  |    :map notmuch-message-mode-map
  |    :localleader
  | 
  |    "M t" #'cashweaver-mail-toggle-org-message-mode)
  | 
  |   (map!
  |    :map notmuch-show-mode-map
  | 
  |    "M-RET" #'cashweaver-notmuch-show-open-or-close-all)
  | 
  |   ;; Reply-all should be the default.
  |   (evil-define-key 'normal notmuch-show-mode-map "cr" 'notmuch-show-reply)
  |   (evil-define-key 'normal notmuch-show-mode-map "cR" 'notmuch-show-reply-sender)
  | 
  |   ;; Easy archive for my most-used tags.
  |   (evil-define-key 'normal notmuch-search-mode-map "A" 'notmuch-search-archive-thread)
  |   (evil-define-key 'normal notmuch-search-mode-map "a" 'cashweaver-notmuch-search-super-archive)
  |   (evil-define-key 'visual notmuch-search-mode-map "a" 'cashweaver-notmuch-search-super-archive)
  | 
  |   ;; Unbind "t", and re-bind it to "T", so we can set it up as a prefix.
  |   (evil-define-key 'normal notmuch-search-mode-map "t" nil)
  |   (evil-define-key 'normal notmuch-search-mode-map "T" 'notmuch-search-filter-by-tag)
  | 
  |   ;; Helpers for toggling often-used tags.
  |   (evil-lambda-key 'normal notmuch-search-mode-map "t0" '(lambda ()
  |                                                            "Toggle p0"
  |                                                            (interactive)
  |                                                            (cashweaver-notmuch-search-toggle-tag "p0")))
  |   (evil-lambda-key 'normal notmuch-search-mode-map "tr" '(lambda ()
  |                                                            "Toggle Read!"
  |                                                            (interactive)
  |                                                            (cashweaver-notmuch-search-toggle-tag "Read!")))
  |   (evil-lambda-key 'normal notmuch-search-mode-map "tw" '(lambda ()
  |                                                            "Toggle waiting"
  |                                                            (interactive)
  |                                                            (cashweaver-notmuch-search-toggle-tag "waiting"))))
  | 

  `----


9 Load Additional Config Files
==============================

9.1 `config-work.el'
~~~~~~~~~~~~~~~~~~~~

  ,----
  | (if (cashweaver-is-work-p)
  |     (load (concat cashweaver-work-config-dir "/config-work.el")))
  `----


9.2 `packages-work.el'
~~~~~~~~~~~~~~~~~~~~~~

  ,----
  | (if (cashweaver-is-work-p)
  |     (load (concat cashweaver-work-config-dir "/packages-work.el")))
  `----



Footnotes
_________

[1] 1. [Diego Zamboni]
(<https://github.com/zzamboni/dot-doom/blob/master/doom.org>)
